package com.learning.scala_slides2

/**
 * Написать программу, которая на вход принимает 4 числа, а на выходе указывает можно ли найти такие арифметические действия (умножение, деление, разность или сумма), чтобы приравнять результат первых двух чисел к результату вторых двух чисел.
 * Если можно, то программа выводит Y, если нельзя, то N.
 * Например, на вход подается: 1 5 8 2
 * Программа отвечает Y, потому что 1+5 = 8-2
 *
 * Синтаксис создания массива:
 * val arr:Array(Int) = Array(1,2,3) или val arr=Array(1,2,3)
 */
object Task1_3 {

  def main(args: Array[Int]): Unit = {

  }

}
